; domain
(define (domain logistics-strips)
  (:requirements
                :strips)
  (:types
            tOBJ tTRUCK tLOCATION tCITY tAIRPLANE tAIRPLANEACCESS0 tAIRPLANEACCESS1 tAIRPLANEACCESS2 tAIRPLANEACCESS3 tAIRPORTACCESS0 tAIRPORTACCESS1 tAIRPORTACCESS2 tAIRPORTACCESS3- object
            tAIRPLANEACCESS0 tAIRPLANEACCESS1 tAIRPLANEACCESS2 tAIRPLANEACCESS3 - tAIRPLANE
            tAIRPORTACCESS0 tAIRPORTACCESS1 tAIRPORTACCESS2 tAIRPORTACCESS3 - tLOCATION )
  (:predicates
            (OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
        (AIRPLANE ?airplane)
		(AIRPLANEACCESS0 ?airplane)
		(AIRPLANEACCESS1 ?airplane)
		(AIRPLANEACCESS2 ?airplane)
		(AIRPLANEACCESS3 ?airplane)
                (CITY ?city)
                (AIRPORTACCESS0 ?airport)
                (AIRPORTACCESS1 ?airport)
                (AIRPORTACCESS2 ?airport)
                (AIRPORTACCESS3 ?airport)
		(in ?obj ?loc)
		(in ?obj1 ?obj2)
		(inCity ?obj ?city))

;IMPORTANT in-city is swapped to inCity. "-" is used as a special character and allowed in naming. This is a mistake for a language specification.
; ALSO IMPORTANT. loc-from and loc-to have been changed to locFrom and locTo. The "-" is used in other places such as object definition , as a language special character.
; this is a mistake on pddl specificaiton on what characters should be allowed in names.
; IMPORTANT do NOT use "_" in any naming

; ==================================================================================

(:action LOAD-TRUCK
  :parameters
   (?obj - tOBJ
    ?truck - tTRUCK
    ?loc - tLOCATION )
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (in ?truck ?loc) (in ?obj ?loc))
  :effect
   (and (not (in ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj - tOBJ
    ?airplane - tAIRPLANE
    ?loc - tLOCATION )
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (in ?obj ?loc) (in ?airplane ?loc))
  :effect
   (and (not (in ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - tOBJ
    ?truck - tTRUCK
    ?loc - tLOCATION)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (in ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (in ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj - tOBJ
    ?airplane - tAIRPLANE
    ?loc - tLOCATION )
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (in ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (in ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - tTRUCK
    ?locFrom - tLOCATION
    ?locTo - tLOCATION
    ?city - tCITY )
  :precondition
   (and (TRUCK ?truck) (LOCATION ?locFrom) (LOCATION ?locTo) (CITY ?city)
   (in ?truck ?locFrom)
   (inCity ?locFrom ?city)
   (inCity ?locTo ?city))
  :effect
   (and (not (in ?truck ?locFrom)) (in ?truck ?locTo)))

;=======================================================
; The different fly actions for different access regions

(:action FLY-AIRPLANEACCESS0
  :parameters
   (?airplane - tAIRPLANEACCESS0
    ?locFrom - tAIRPORTACCESS0
    ?locTo - tAIRPORTACCESS0 )
  :precondition
   (and (AIRPLANEACCESS0 ?airplane) (AIRPORTACCESS0 ?locFrom) (AIRPORTACCESS0 ?locTo)
	(in ?airplane ?locFrom))
  :effect
   (and (not (in ?airplane ?locFrom)) (in ?airplane ?locTo)))

(:action FLY-AIRPLANEACCESS1
  :parameters
   (?airplane - tAIRPLANEACCESS1
    ?locFrom - tAIRPORTACCESS1
    ?locTo - tAIRPORTACCESS1 )
  :precondition
   (and (AIRPLANEACCESS1 ?airplane) (AIRPORTACCESS1 ?locFrom) (AIRPORTACCESS1 ?locTo)
	(in ?airplane ?locFrom))
  :effect
   (and (not (in ?airplane ?locFrom)) (in ?airplane ?locTo)))


(:action FLY-AIRPLANEACCESS2
  :parameters
   (?airplane - tAIRPLANEACCESS2
    ?locFrom - tAIRPORTACCESS2
    ?locTo - tAIRPORTACCESS2 )
  :precondition
   (and (AIRPLANEACCESS2 ?airplane) (AIRPORTACCESS2 ?locFrom) (AIRPORTACCESS2 ?locTo)
	(in ?airplane ?locFrom))
  :effect
   (and (not (in ?airplane ?locFrom)) (in ?airplane ?locTo)))


(:action FLY-AIRPLANEACCESS3
  :parameters
   (?airplane - tAIRPLANEACCESS3
    ?locFrom - tAIRPORTACCESS3
    ?locTo - tAIRPORTACCESS3 )
  :precondition
   (and (AIRPLANEACCESS3 ?airplane) (AIRPORTACCESS3 ?locFrom) (AIRPORTACCESS3 ?locTo)
	(in ?airplane ?locFrom))
  :effect
   (and (not (in ?airplane ?locFrom)) (in ?airplane ?locTo)))


) ; END OF DOMAIN FILE

; problem
(define (problem logistics-c8-s4-p1-a4)
(:domain logistics-strips)
(:objects
          c0 c1 c2 c3 c4 c5 c6 c7 - tCITY
          t0 t1 t2 t3 t4 t5 t6 t7 - tTRUCK
          l01 l02 l03 l11 l12 l13 l21 l22 l23 l31 l32 l41 l42 l51 l52 l61 l62 l71 l72 l73 - tLOCATION
          p0 - tOBJ
          a0 - tAIRPLANEACCESS0
          a1 - tAIRPLANEACCESS1
          a2 - tAIRPLANEACCESS2
          a3 - tAIRPLANEACCESS3
          l00 l10 l20 l30 - tAIRPORTACCESS0
                  l43 l33 - tAIRPORTACCESS1
              l40 l50 l60 - tAIRPORTACCESS2
              l70 l53 l63 - tAIRPORTACCESS3
)
; The major modification is that the airplanes are both regular airplanes (for loading and unloading) as well as special airplanes for accessing specific
; subset of cities. This separates the cities.
; a0 a1 a2 a3 - tAIRPLANE
;IMPORTANT in-city is swapped to inCity. "-" is used as a special character and allowed in naming. This is a mistake for a language specification.
; IMPORTANT do NOT use "_" in any naming

(:init
(AIRPLANE a0)
(AIRPLANE a1)
(AIRPLANE a2)
(AIRPLANE a3)
(AIRPLANEACCESS0 a0)
(AIRPLANEACCESS1 a1)
(AIRPLANEACCESS2 a2)
(AIRPLANEACCESS3 a3)
(CITY c0)
(CITY c1)
(CITY c2)
(CITY c3)
(CITY c4)
(CITY c5)
(CITY c6)
(CITY c7)
(TRUCK t0)
(TRUCK t1)
(TRUCK t2)
(TRUCK t3)
(TRUCK t4)
(TRUCK t5)
(TRUCK t6)
(TRUCK t7)
(LOCATION l00)
(inCity  l00 c0)
(LOCATION l01)
(inCity  l01 c0)
(LOCATION l02)
(inCity  l02 c0)
(LOCATION l03)
(inCity  l03 c0)
(LOCATION l10)
(inCity  l10 c1)
(LOCATION l11)
(inCity  l11 c1)
(LOCATION l12)
(inCity  l12 c1)
(LOCATION l13)
(inCity  l13 c1)
(LOCATION l20)
(inCity  l20 c2)
(LOCATION l21)
(inCity  l21 c2)
(LOCATION l22)
(inCity  l22 c2)
(LOCATION l23)
(inCity  l23 c2)
(LOCATION l30)
(inCity  l30 c3)
(LOCATION l31)
(inCity  l31 c3)
(LOCATION l32)
(inCity  l32 c3)
(LOCATION l33)
(inCity  l33 c3)
(LOCATION l40)
(inCity  l40 c4)
(LOCATION l41)
(inCity  l41 c4)
(LOCATION l42)
(inCity  l42 c4)
(LOCATION l43)
(inCity  l43 c4)
(LOCATION l50)
(inCity  l50 c5)
(LOCATION l51)
(inCity  l51 c5)
(LOCATION l52)
(inCity  l52 c5)
(LOCATION l53)
(inCity  l53 c5)
(LOCATION l60)
(inCity  l60 c6)
(LOCATION l61)
(inCity  l61 c6)
(LOCATION l62)
(inCity  l62 c6)
(LOCATION l63)
(inCity  l63 c6)
(LOCATION l70)
(inCity  l70 c7)
(LOCATION l71)
(inCity  l71 c7)
(LOCATION l72)
(inCity  l72 c7)
(LOCATION l73)
(inCity  l73 c7)
(AIRPORTACCESS0 l00)
(AIRPORTACCESS0 l10)
(AIRPORTACCESS0 l20)
(AIRPORTACCESS0 l30)

(AIRPORTACCESS1 l33)
(AIRPORTACCESS1 l43)

(AIRPORTACCESS2 l40)
(AIRPORTACCESS2 l50)
(AIRPORTACCESS2 l60)

(AIRPORTACCESS3 l53)
(AIRPORTACCESS3 l63)
(AIRPORTACCESS3 l70)
(OBJ p0)
(in t0 l01)
(in t1 l11)
(in t2 l22)
(in t3 l31)
(in t4 l42)
(in t5 l50)
(in t6 l60)
(in t7 l70)
(in p0 l02)
(in a0 l10)
(in a1 l33)
(in a2 l60)
(in a3 l63)
)
(:goal
(and
(in p0 l73)
)
)
)

; plan
1. (drive-truck t4 l42 l40 c4)
   deleted: (in t4 l42)
   added: (in t4 l40)
   goals met: 0 of 1
2. (drive-truck t3 l31 l30 c3)
   deleted: (in t3 l31)
   added: (in t3 l30)
   goals met: 0 of 1
3. (drive-truck t0 l01 l00 c0)
   deleted: (in t0 l01)
   added: (in t0 l00)
   goals met: 0 of 1
4. (fly-airplaneaccess0 a0 l10 l00)
   deleted: (in a0 l10)
   added: (in a0 l00)
   goals met: 0 of 1
5. (drive-truck t0 l00 l02 c0)
   deleted: (in t0 l00)
   added: (in t0 l02)
   goals met: 0 of 1
6. (load-truck p0 t0 l02)
   deleted: (in p0 l02)
   added: (in p0 t0)
   goals met: 0 of 1
7. (drive-truck t0 l02 l00 c0)
   deleted: (in t0 l02)
   added: (in t0 l00)
   goals met: 0 of 1
8. (unload-truck p0 t0 l00)
   deleted: (in p0 t0)
   added: (in p0 l00)
   goals met: 0 of 1
9. (load-airplane p0 a0 l00)
   deleted: (in p0 l00)
   added: (in p0 a0)
   goals met: 0 of 1
10. (fly-airplaneaccess0 a0 l00 l30)
   deleted: (in a0 l00)
   added: (in a0 l30)
   goals met: 0 of 1
11. (unload-airplane p0 a0 l30)
   deleted: (in p0 a0)
   added: (in p0 l30)
   goals met: 0 of 1
12. (load-truck p0 t3 l30)
   deleted: (in p0 l30)
   added: (in p0 t3)
   goals met: 0 of 1
13. (drive-truck t3 l30 l33 c3)
   deleted: (in t3 l30)
   added: (in t3 l33)
   goals met: 0 of 1
14. (unload-truck p0 t3 l33)
   deleted: (in p0 t3)
   added: (in p0 l33)
   goals met: 0 of 1
15. (load-airplane p0 a1 l33)
   deleted: (in p0 l33)
   added: (in p0 a1)
   goals met: 0 of 1
16. (fly-airplaneaccess1 a1 l33 l43)
   deleted: (in a1 l33)
   added: (in a1 l43)
   goals met: 0 of 1
17. (unload-airplane p0 a1 l43)
   deleted: (in p0 a1)
   added: (in p0 l43)
   goals met: 0 of 1
18. (drive-truck t4 l40 l43 c4)
   deleted: (in t4 l40)
   added: (in t4 l43)
   goals met: 0 of 1
19. (load-truck p0 t4 l43)
   deleted: (in p0 l43)
   added: (in p0 t4)
   goals met: 0 of 1
20. (drive-truck t4 l43 l40 c4)
   deleted: (in t4 l43)
   added: (in t4 l40)
   goals met: 0 of 1
21. (unload-truck p0 t4 l40)
   deleted: (in p0 t4)
   added: (in p0 l40)
   goals met: 0 of 1
22. (fly-airplaneaccess2 a2 l60 l40)
   deleted: (in a2 l60)
   added: (in a2 l40)
   goals met: 0 of 1
23. (load-airplane p0 a2 l40)
   deleted: (in p0 l40)
   added: (in p0 a2)
   goals met: 0 of 1
24. (fly-airplaneaccess2 a2 l40 l60)
   deleted: (in a2 l40)
   added: (in a2 l60)
   goals met: 0 of 1
25. (unload-airplane p0 a2 l60)
   deleted: (in p0 a2)
   added: (in p0 l60)
   goals met: 0 of 1
26. (load-truck p0 t6 l60)
   deleted: (in p0 l60)
   added: (in p0 t6)
   goals met: 0 of 1
27. (drive-truck t6 l60 l63 c6)
   deleted: (in t6 l60)
   added: (in t6 l63)
   goals met: 0 of 1
28. (unload-truck p0 t6 l63)
   deleted: (in p0 t6)
   added: (in p0 l63)
   goals met: 0 of 1
29. (load-airplane p0 a3 l63)
   deleted: (in p0 l63)
   added: (in p0 a3)
   goals met: 0 of 1
30. (fly-airplaneaccess3 a3 l63 l70)
   deleted: (in a3 l63)
   added: (in a3 l70)
   goals met: 0 of 1
31. (unload-airplane p0 a3 l70)
   deleted: (in p0 a3)
   added: (in p0 l70)
   goals met: 0 of 1
32. (load-truck p0 t7 l70)
   deleted: (in p0 l70)
   added: (in p0 t7)
   goals met: 0 of 1
33. (drive-truck t7 l70 l73 c7)
   deleted: (in t7 l70)
   added: (in t7 l73)
   goals met: 0 of 1
34. (unload-truck p0 t7 l73)
   deleted: (in p0 t7)
   added: (in p0 l73)
   goals met: 1 of 1
